#####################################算术运算符#################################################
# 加:+   减:-   乘:*   除:/    整除://(结果为整数)
# 取余/求模:%  (例:10 % 3 即10模于3,结果为1)  幂指数:** (例:10 ** 3 即10的3次方)
# print("10 + 3 =",10 + 3)
# print("10 - 3 =",10 - 3)
# print("10 * 3 =",10 * 3)
# print("10 / 3 =",10 / 3)
# print("10 % 3 =",10 % 3)
# print("10 // 3 =",10 // 3)
# print("10 ** 3 =",10 ** 3)

# 算数运算符的优先级 -->     **   >   * / // %    >    + -
# print("0.1 + 10 / 4 ** 2 =",0.1 + 10 / 4 ** 2 )

#要求输入两个数x 和 y ,分别输出 x + y 和 x - y
# x = 2
# y = 3
# print("x + y =",x + y)
# print("x - y =",x - y) # 大错特错


#答案
# x = float(input("请输入x的值:"))
# y = float(input("请输入y的值:"))
# print("x+y=",x+y)
# print("x-y=",x-y) #两个小数相减出错错误,原因:精度损失,由于计算机底层是基于
                  #二进制 进行数据的存储与处理,二进制无法准确表示所有小数,因此在涉及到浮点数,可能会出现损失


#计算输入的三个整数的平均数
# x = int(input("请输入第一个整数:"))
# y = int(input("请输入第二个整数:"))
# z = int(input("请输入第三个整数:"))
# print("(x+y+z)/3=",(x+y+z)/3)

#输入梯形的上底,下底和高,然后计算题型的面积
# a = float(input("请输入梯形的高:"))
# b = float(input("请输入梯形的上底:"))
# c = float(input("请输入梯形的下底:"))
# print((c+b)*a/2)

#要求输入圆的半径,然后计算圆的周长和面积
# r = float(input("请输入圆的半径:"))
# print("圆的周长为:",2*3.14*r)
# print("圆的面积为:",3.14*r*r)

#身体质量指数BMI的计算(BMI = 体重(kg)/身高(m)²
# a = float(input("请输入您的体重(kg):"))
# b = float(input("请输入您的身高(m):"))
# print("您的身体质量指数BMI为:",a / (b * b))

###################################赋值运算符(=,+=,-=,*=,/=,%=,//=,**=)#########################
# num = 85
# num += 10
# print("num加10后,num=",num )
#
# num -= 10
# print("num减10后.num=",num)
#
# num *= 10
# print("num乘10后,num=",num)
#
# num /= 10
# print("num除于10后,num=",num)
#
# num %= 10
# print("num对10取余后,num=",num)
#
# num //= 2
# print("num整除2后,num=",num)
#
# num **= 3
# print("num的3次方后,num=",num)


####################比较运算符(==,!=,>,>=,<,<=)会计算运算符两边的表达式,然后返回一个布尔值##################
# print(100 == 100)  #True
# print(100 != 100)  #False
# print(100 > 100)   #False
# print(100 >= 100)  #True
# print(100 < 100)   #False
# print(100 <= 100)  #True

#数学计算中,判断一个数是否为偶数,使用哪个关系运算符呢
# num = int(input("请输入需要进行判断的数:"))
# print("num是否为偶数",num % 2 == 0)
#购买商品支付时,需要判断银行卡余额是否足够,使用哪个关系运算符呢?
# money = 10000
# num = float(input("商品的价格为:"))
# print("银行卡余额是否足够",money >= num)


##################################逻辑运算符###################################################3
#and逻辑与,or逻辑或,not逻辑非

#键盘输入一个整数,判断这个整数是否在10-20之间
# num = int(input("请输入一个整数:"))
# print(f"{num}是否在10-20之间:",num >= 10 and num <=20)

#键盘输入一个整数,判断这个整数是否不在10-20之间
# num = int(input("请输入一个整数:"))
# print(f"{num}是否不在10-20之间:",num < 10 or num > 20)