# 字符串定义的三种方式
# s1 = 'Hello' #单引号定义
# s2 = "ni hao" #双引号定义
# s3 = """
# Hello
#    欢迎
#       加强蛇兜
# """  #三引号定义
# print(s1)
# print(s2)
# print(s3)
#
# # 转义字符
# # \' -->单引号
# a = 'it\'s so good'
# print(a) #当单引号定义的字符串中需要再次出现单引号时,可以用转义字符 \'
#
# # \" -->双引号
# b = "忍者就是忍\"着\""
# print(b)
#
# # \n -->换行符
# print("第一行\n第二行\n第三行")
#
# # \t -->制表符
# print("空出距离\t空出距离")


##############字符串拼接
# + :可以用来拼接两个字符串,但是无法将非字符串与字符串进行拼接
# s1 = "人生苦短" ",""我用Python"
# print(s1)  #了解即可
#
# a = "人生苦短"
# b = "我用Python"
# print("龟哥说:" + a + "," + b)

# 根据自己的实际情况,输出自己的个人信息
# 结构:大家好,我是涛哥,今年18岁,学习的专业是软件工程,爱好Python,Java
# name = input("请输入你的姓名:")
# age = input("请输入你的年龄:")
# major = input("请输入你的专业:")
# hobby = input("请输入你的爱好:")
# print("大家好,我是"+name+","+"今年"+age+"岁"+","+"学习的专业是"+major+","+"爱好"+hobby)


############################# 字符串格式化 ################################################
# %s -->占位符.(会自动进行格式转化)
# name = "涛哥"
# age = 18
# major = "软件工程"
# hobby = "Python,Java"
# print("大家好,我是%s,今年%s岁,学习的专业是%s,爱好%s" % (name,age,major,hobby))

# f"内容{变量/表达式}"
name = "涛哥"
age = 18
major = "软件工程"
hobby = "Python,Java"
print(f"大家好,我是{name},今年{age}岁,学习的专业是{major},爱好{hobby}")