#列表的定义
# 列表名 = [元素1,元素2,元素3,元素4...]
# 特点:①列表内的元素可以是不同类型②列表内的元素是有序的,可重复的③列表内的元素可以进行修改
# s = [1,45,2.5,"Python",True]
# print(type(s))
#
# # 索引
# print(s[0])
# print(s[-5])
# print(s[3])
# print(s[-2])
#
# # 查询,当索引超出范围,将会报错
# print(s[2])
#
# # print(s[7])
#
# # 修改
# s[0] = 18
# print(s)
#
# # 删除
# del s[1]
# print(s)
#
# # 遍历
# for i in s:
#     print(i)


# 切片:对操作的书局截取其中的一部分
# 语法:序列数据[开始索引:结束索引:步长],不包含结束索引位置对应的元素(开始索引未指定默认为0,结束
# 索引未指定默认直到列表末尾,步长未指定默认为1)
s = ["A","C","D","G","R","G"]

#截取A到G(包含G)之间的元素
print(s[0:4:1])
print(s[:4:])
print(s[:4])

print(s[0:5:2])
print(s[:5:2])

print(s[0:-1:1])
print(type(s[0:-1:1]))

